dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER1_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER1_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER1_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER1_EN_OFF (18u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG0_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG0_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG0_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG0_EN_OFF (19u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG1_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG1_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG1_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG1_EN_OFF (20u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_OFF (30u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MCAN20_EN */
#define IFX_MTU_MEMTEST1_MCAN20_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MCAN20_EN */
#define IFX_MTU_MEMTEST1_MCAN20_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MCAN20_EN */
#define IFX_MTU_MEMTEST1_MCAN20_EN_OFF (31u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_OFF (2u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_OFF (4u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_OFF (6u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_OFF (13u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_OFF (14u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_OFF (18u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_OFF (19u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.HSPDM_RAM_EN */
#define IFX_MTU_MEMTEST2_HSPDM_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.HSPDM_RAM_EN */
#define IFX_MTU_MEMTEST2_HSPDM_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.HSPDM_RAM_EN */
#define IFX_MTU_MEMTEST2_HSPDM_RAM_EN_OFF (21u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT00_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT00_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT00_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT00_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT00_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT00_RAM_EN_OFF (24u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT01_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT01_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT01_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT01_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT01_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT01_RAM_EN_OFF (25u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT10_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT10_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT10_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT10_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT10_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT10_RAM_EN_OFF (26u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT11_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT11_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT11_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT11_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT11_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT11_RAM_EN_OFF (27u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT20_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT20_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT20_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT20_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT20_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT20_RAM_EN_OFF (28u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT21_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT21_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT21_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT21_RAM_EN_MSK (0x1u)

